In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("Bank_Customer.csv", low_memory = False)

In [3]:
df.head()

    age           job  marital  education  balance duration
0  58.0    management  married   tertiary     2143      261
1  44.0    technician   single  secondary       29      151
2  33.0  entrepreneur  married  secondary        2       76
3  47.0   blue-collar  married    unknown     1506       92
4  33.0       unknown   single    unknown        1      198

In [4]:
df.shape

(1090, 6)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1090 entries, 0 to 1089
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        1000 non-null   float64
 1   job        1090 non-null   object
 2   marital    1090 non-null   object
 3   education  1090 non-null   object
 4   balance    1090 non-null   int64
 5   duration   1090 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 51.2+ KB

In [7]:
z = df.duplicated()
df = df[~z]

In [8]:
df.shape

(1090, 6)

In [9]:
print(df.isnull().sum())

age          90
job           0
marital       0
education     0
balance       0
duration      0
dtype: int64

In [13]:
df.replace('unknown', pd.NA, inplace=True)

In [14]:
print(df.isnull().sum())

age           0
job           5
marital       0
education    94
balance       0
duration      0
dtype: int64

In [15]:
for col in df.columns:
    if df[col].dtype == 'object':
        mode_value = df[col].mode()[0]
        df.loc[df[col].isnull(), col] = mode_value
    else:
        mean_value = df[col].mean()
        df.loc[df[col].isnull(), col] = mean_value

In [16]:
print(df.isnull().sum())

age          0
job          0
marital      0
education    0
balance      0
duration     0
dtype: int64

In [17]:
df

         age           job  marital  education  balance duration
0     58.000    management  married   tertiary   2143.0      261
1     44.000    technician   single  secondary     29.0      151
2     33.000  entrepreneur  married  secondary      2.0       76
3     47.000   blue-collar  married  secondary   1506.0       92
4     33.000   blue-collar   single  secondary      1.0      198
...      ...           ...      ...        ...      ...      ...
1085  42.582        admin.  married    primary    136.0      283
1086  42.582   blue-collar   single  secondary   2167.0     1273
1087  42.582   blue-collar  married  secondary    309.0     1574
1088  42.582    technician  married  secondary    221.0      139
1089  42.582   blue-collar  married    primary    321.0      228

[1090 rows x 6 columns]